package t3_loops.example_3;

public class Test {
    public static void main(String[] args) {


        // Распечатать все четные числа
//        for (int i = 1; i <= 10; i++) {
//            if (i % 2 == 0) {
//                System.out.println(i);
//            }
//        }
//        // Распечатать сумму всех чисел от 1 до 100 кратные 3
        // Ожидаемый результат: 1683


//        int counter = 0;
//
//        for (int i = 0; i < 10; i = i + 1) {
//            if (i > 7) {
//                counter = counter + 2;
//            }
//            counter = counter + 1;
//        }
//
//        System.out.println(counter);

//        for (int i = 1; i <= 3; i++) {
//            System.out.println("День " + i);
//            for (int j = 1; j <= 5; j++) {
//                System.out.println("  Пробежка " + j);
//            }
//        }

        //Этаж 1 квартира 1 — доставлено.
        //Этаж 1 квартира 2 — доставлено.
        //Этаж 1 квартира 3 — доставлено.
        //Этаж 1 квартира 4 — доставлено.
        //Этаж 1 квартира 5 — доставлено.
        //Этаж 2 квартира 6 — доставлено.
        //Этаж 2 квартира 7 — доставлено.
        //Этаж 2 квартира 8 — доставлено.
        //Этаж 2 квартира 9 — доставлено.
        //Этаж 2 квартира 10 — доставлено.
        //Этаж 3 квартира 11 — доставлено.
        //Этаж 3 квартира 12 — доставлено.
        //...
        //Этаж 10 квартира 47 – доставлено.
        //Этаж 10 квартира 48 – доставлено.
        //Этаж 10 квартира 49 – доставлено.
        //Этаж 10 квартира 50 – доставлено.


//      #
//      ##
//      ###
//      ####
//      #####


//        for (int steps = 1; steps <= 5; steps++) {
//            // здесь распечатаете пробелы перед блоками
//
//            for (int blocks = 1; blocks <= steps; blocks++) {
//                System.out.print("#");
//            }
//            System.out.println();
//        }

//      |    #       4 1
//      |   ##       3 2
//      |  ###       2 3
//      | ####       1 4
//      |#####       0 5

//        int num = new Scanner(System.in).nextInt();
//
//        for (int i = 1; i <= num; i++) {
//            System.out.println(num - i + " " + i);
//        }



        // День 1
        //   Серия 1
        //   Серия 2
        //   Серия 3
        // День 2
        //   Серия 1
        //   Серия 2
        //   Серия 3
        // День 3
        //   Серия 1
        //   Серия 2
        //   Серия 3
        // ...
        // День 30
    }
}
