import java.util.Scanner;

public class Test {
    public static void main(String[] args) {
//        Scanner scanner = new Scanner(System.in);
//
//        scanner.next();


//        int age = scanner.nextInt();
//
//        if (age < 5) {
//            System.out.println("Ребенок");
//        } else if (age < 12) {
//            System.out.println("Юноша");
//        } else if (age < 19) {
//            System.out.println("Подросток");
//        } else {
//            System.out.println("Взрослый");
//        }
//
//        int a = 5;
//        int b = ++a;
//        int c = ++b;
//
//        System.out.println(a);
//        System.out.println(b);
//        System.out.println(c);


        // Запрашиваете оценку:
        // Если оценка от 90 и выше - "Отлично"
        // Иначе если оценка от 75 и выше - "Хорошо"
        // Иначе если оценка от 60 и выше - "Удовлетворительно"
        // Иначе - "Неудовлетворительно"


        // до 5 - ребенок
        // до 12 - юноша
        // до 19 - подросток
        // иначе - взрослый

//        String color = scanner.nextLine();
//
//        if (color.equals("Зеленый")) {
//            System.out.println("Идем");
//
//        } else if (color.equals("Желтый")) {
//            System.out.println("Подготовка");
//
//        } else if (color.equals("Красный")) {
//            System.out.println("Ждем");
//        } else {
//            System.out.println("Некорректный цвет");
//        }

        // Задача 4
        //Напишите программу, которая:
        //- Запрашивает у пользователя сумму покупки.
        //- Рассчитывает скидку в зависимости от суммы покупки.
        //- Выводит на экран новую цену товара с учетом скидки.
        //⁠В магазине действует накопительная система скидок:
        //- 5% скидки при сумме покупок от 50 000 тг.
        //- 10% скидки при сумме покупок от 100 000 тг.
        //- 15% скидки при сумме покупок от 200 000 тг.


        // Добавить,
        // Обновить
        // Удалить

//        String command = "Обновить";
//
//        switch (command) {
//            case "Добавить" -> System.out.println("Добавление...");
//            case "Обновить" -> System.out.println("Обновление...");
//            case "Удалить" -> System.out.println("Удаление...");
//            default -> System.out.println("Некорректная команда");
//        }
//
//        if ((color.equals("Рыжий")) && (age < 2) && (weight > 100)) {
//            System.out.println("Берём хомяка домой!");
//        }
//        Scanner scanner = new Scanner(System.in);
//
//        System.out.print("Введите логин: ");
//        String login = scanner.next();
//
//        System.out.print("Введите пароль: ");
//        String password = scanner.next();
//
//        if ((login.equals("admin")) && (password.equals("1234"))) {
//            System.out.println("Доступ разрешен");
//        } else {
//            System.out.println("Неверный логин или пароль");
//        }


//        System.out.println(true && true);
//        System.out.println(true && false);
//        System.out.println(false && true);
//        System.out.println(false && false);


//        Scanner scanner = new Scanner(System.in);
//
//        System.out.print("Цвет яблоки: ");
//        String color = scanner.next();
//
//        if (color.equals("красный")) {
//
//            System.out.print("Есть ли дома фрукты? ");
//            String answer = scanner.next();
//
//            if (answer.equals("да")) {
//                System.out.println("Покупаем 1 кг яблок");
//            } else {
//                System.out.println("Покупаем 3 кг яблок");
//            }
//        } else {
//            System.out.println("Покупаем апельсины");
//        }


        // Запрашиваете сумму покупки
        // Если сумма больше 100 000
        //    Запрашиваете скидку
        //    Если скидка от 5 до 50
        //        Вам предоставлена __% скидка, что составило: ___ тг
        //    Иначе
        //        Ошибка: скидка должна быть в размере от 5 до 50
        // Иначе
        //    Скидка не предоставляется





//        int age = 19;
//        String country = "USA";
//        String state = "Alaska";
//
//        if (age < 18) {
//            if (country.equals("USA")) {
//                if (state.equals("New York")) {
//                    System.out.println("Можете водить машину, но вам нельзя покидать пределы Нью-Йорка.");
//                } else {
//                    System.out.println("Придётся подождать до 18 или переехать в Нью-Йорк.");
//                }
//            } else {
//                System.out.println("Придётся подождать до 18.");
//            }
//        } else {
//            System.out.println("Можете водить где угодно.");
//        }

//        if (command.equals("Добавить")) {
//            System.out.println("Добавление...");
//        } else if (command.equals("Обновить")) {
//            System.out.println("Обновление...");
//        } else if (command.equals("Удалить")) {
//            System.out.println("Удаление...");
//        } else {
//            System.out.println("Некорректная команда");
//        }


//        Scanner scanner = new Scanner(System.in);
//        int price = scanner.nextInt();
//
//        if (price >= 200_000) {
//            System.out.println("Стоимость с учётом скидки: " + price * 0.85);
//        } else if (price >= 100_000) {
//            System.out.println("Стоимость с учётом скидки: " + price * 0.9);
//        } else if (price >= 50_000) {
//            System.out.println("Стоимость с учётом скидки: " + price * 0.95);
//        } else {
//            System.out.println("Нет скидки");
//        }


        // сниппеты


    }
}
